fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбоненскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
    <comment>Задача по диплому</comment>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ++ Исаев Д.А. Задача: диплом от 20.01.2026
	Группа = Элементы.Добавить("НовыеРеквизиты", Тип("ГруппаФормы"));
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Реквизиты для договора с абоненским обслуживанием";
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		Элементы.НовыеРеквизиты.Видимость = Истина;
	Иначе
		Элементы.НовыеРеквизиты.Видимость = Ложь;
	КонецЕсли;

	
	Поле1 = Элементы.Добавить("ВКМ_ДатаНачалаДействия", Тип("ПолеФормы"), Группа);
	Поле1.Вид = ВидПоляФормы.ПолеВвода;
	Поле1.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия"; 
	
	Поле2 = Элементы.Добавить("ВКМ_ДатаОкончанияДействия", Тип("ПолеФормы"), Группа);
	Поле2.Вид = ВидПоляФормы.ПолеВвода;
	Поле2.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
	Поле2.УстановитьДействие("ПриИзменении", "ВКМ_ДатаОкончанияДействияПриИзменении");
	
	Поле3 = Элементы.Добавить("ВКМ_СуммаАбоненскойПлаты", Тип("ПолеФормы"), Группа);
	Поле3.Вид = ВидПоляФормы.ПолеВвода;
	Поле3.ПутьКДанным = "Объект.ВКМ_СуммаАбоненскойПлаты"; 
	
	Поле4 = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), Группа);
	Поле4.Вид = ВидПоляФормы.ПолеВвода;
	Поле4.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";	
	// -- Исаев Д.А. от 20.01.2026  
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ++ Исаев Д.А. Задача: диплом от 20.01.2026
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		Элементы.НовыеРеквизиты.Видимость = Истина;
	Иначе
		Элементы.НовыеРеквизиты.Видимость = Ложь;
	КонецЕсли;	
	// -- Исаев Д.А. от 20.01.2026
	
КонецПроцедуры 

&НаКлиенте
Процедура ВКМ_ДатаОкончанияДействияПриИзменении(Элемент)
	
	// ++ Исаев Д.А. Задача: диплом от 20.01.2026
    Объект.ВКМ_ДатаОкончанияДействия = КонецДня(Объект.ВКМ_ДатаОкончанияДействия);
	// -- Исаев Д.А. от 20.01.2026
	
КонецПроцедуры
